
## <center>  Exploratory data analysis with Pandas

[mlcourse.ai](https://mlcourse.ai) - Open Machine Learning Course
    
**Same assignment as a [Kaggle Kernel](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset) + [solution](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset-solution).**

In this project we will be exploring the Adult dataset using Pandas. 
We will do this by answering some questions about the dataset in order to not only gain more understanding about our data but also learn how pandas can be used to accomplish this
This project is part of the mlcourse.ai course organized by ... 

Let's strap on seat belts and get rolling

**In this task you should use Pandas to answer a few questions about the [Adult](https://archive.ics.uci.edu/ml/datasets/Adult) dataset. (You don't have to download the data â€“ it's already  in the repository). Choose the answers in the [web-form](https://docs.google.com/forms/d/1uY7MpI2trKx6FLWZte0uVh3ULV4Cm_tDud0VDFGCOKg).**

Taking a look at the unique values of all features (for more information, please see the links above):
- `age`: continuous.
- `workclass`: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- `fnlwgt`: continuous.
- `education`: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- `education-num`: continuous.
- `marital-status`: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- `occupation`: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- `relationship`: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- `race`: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- `sex`: Female, Male.
- `capital-gain`: continuous.
- `capital-loss`: continuous.
- `hours-per-week`: continuous.
- `native-country`: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.   
- `salary`: >50K,<=50K

In [7]:
import numpy as np
import pandas as pd
pd.set_option('display.max.columns', 100)
# to draw pictures in jupyter notebook
%matplotlib inline 
import matplotlib.pyplot as plt
import seaborn as sns
# we don't like warnings
# you can comment the following 2 lines if you'd like to
import warnings

After importing our libraries, we first read the data using pandas `pandas.read_csv` and display the first 5 lines using `dataframe.head`

In [8]:
data = pd.read_csv('../data/adult.data.csv')
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

We can see the number rows and columns in our dataset by using `dataframe.shape`. Our data has 32561 rows(samples) and 15 columns(features) as can be seen below

In [14]:
data.shape

(32561, 15)

Now, let's try to print out the column names using `dataframe.columns`

In [16]:
data.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

Now, we use `dataframe.describe()` to view the summary of the dta like the mean, standard deviation, maximum of each feature.
The output can guide us in making certain decisions about preprocessing our data. For example if the mean values are in different order of magnitude for all features, scaling could significantly improve accuracy of a classifier, if not, then scaling might not be beneficial.

In [9]:
data.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

Notice that the describe method above doesn't show the statistics for non-numerial vlues. In order to display these statistics, we have to explicitly indicate data types we are interested n using the `exclude` parameter.

In [19]:
data.describe(include=['object', 'bool'])

,workclass,education,marital-status,occupation,relationship,race,sex,native-country,salary
count,32561,32561,32561,32561,32561,32561,32561,32561,32561
unique,9,16,7,15,6,5,2,42,2
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,22696,10501,14976,4140,13193,27816,21790,29170,24720

We can basic information about the data integrity i.e data types and detection of NaN values using `dataframe.info()` .
As we can see from the second column, we have no missing values because the total number of rowns for each is 32561 observations which is the same as the total number of rows in the dataset when we did `shape` . In case there are missing values, there are different ways this can be handled. One way is to replace the missing values by the mean.

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
native-country    32561 non-null object
salary            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

The distribution for categorical values i.e columns of type obbject and boool can seen using `dataframe['attribute_name'].value_counts()`. `dataframe['attribute_name'].unique()` can be to see the different observations for a particular column and `dataframe['attribute_name'].nunique()` counts these distinct observations.

Let's see the distribution of men and women in our dataset

In [24]:
data['sex'].unique()

array(['Male', 'Female'], dtype=object)

In [26]:
data['sex'].nunique()

2

In [25]:
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

## Questions
Now that we have some basic insights into our data, its time to go even further and answer some questions concerning the data.

**1. How many men and women (*sex* feature) are represented in this dataset?**

Here we use `value_counts` and index the `sex` column by using `dataframe['attribute_name)]`

In [34]:
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

**2. What is the average age (*age* feature) of women?**

Pandas provides different methods that can be used to get various statistics like the `mean()`, `std()`, `median()` etc
We can get age the average age of women by using the `mean()` as follows:

In [47]:
data[data['sex']=='Female']['age'].mean()

36.85823043357163

**3. What is the percentage of German citizens (*native-country* feature)?**

In [49]:
data[data['native-country']=="Germany"].shape[0] / data.shape[0]

0.004207487485028101

**4-5. What are the mean and standard deviation of age for those who earn more than 50K per year (*salary* feature) and those who earn less than 50K per year?**

In [70]:
poor_age = data[data['salary'] == ">50K"]['age']
rich_age = data[data['salary'] == "<=50K"]['age']

print("The average age of the poor is {} +- {}".
      format(round(poor_age.mean(),2), round(poor_age.std(),2)))

print("The average age of the rich is {} +- {}".
      format(round(rich_age.mean(),2), round(rich_age.std(),2)))

The average age of the poor is 44.25 +- 10.52
The average age of the rich is 36.78 +- 14.02

**6. Is it true that people who earn more than 50K have at least high school education? (*education â€“ Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* or *Doctorate* feature)**

In [73]:
data[data['salary'] == "<=50K"]['education'].unique()

array(['Bachelors', 'HS-grad', '11th', 'Masters', '9th', 'Assoc-acdm',
       '7th-8th', 'Some-college', 'Assoc-voc', '5th-6th', '10th',
       '1st-4th', 'Preschool', '12th', 'Doctorate', 'Prof-school'],
      dtype=object)

As we can see not everyone has atleast a high school disploma. Therefore, the assertion above is false

**7. Display age statistics for each race (*race* feature) and each gender (*sex* feature). Use *groupby()* and *describe()*. Find the maximum age of men of *Amer-Indian-Eskimo* race.**

Pandas provides a `groupby()` method which can be used to split a dataframe, apply a function and split the results. It is defined as:

`df.groupby(by=grouping_columns)[columns_to_show].function()`

1. First, the groupby method divides the grouping_columns by their values. They become a new index in the resulting dataframe.
2. Then, columns of interest are selected (columns_to_show). If columns_to_show is not included, all non groupby clauses will be included.
3. Finally, one or several functions are applied to the obtained groups per selected columns.

In [87]:
data[data['salary'] == "<=50K"]['age']

sub_data = data.groupby(['race','sex'])

for race_sex, df in sub_data:
    print("\nRace: {}, Sex: {}".format(race_sex[0], race_sex[1] ))
    print(df['age'].describe())

Race: Amer-Indian-Eskimo, Sex: Female
count    119.000000
mean      37.117647
std       13.114991
min       17.000000
25%       27.000000
50%       36.000000
75%       46.000000
max       80.000000
Name: age, dtype: float64

Race: Amer-Indian-Eskimo, Sex: Male
count    192.000000
mean      37.208333
std       12.049563
min       17.000000
25%       28.000000
50%       35.000000
75%       45.000000
max       82.000000
Name: age, dtype: float64

Race: Asian-Pac-Islander, Sex: Female
count    346.000000
mean      35.089595
std       12.300845
min       17.000000
25%       25.000000
50%       33.000000
75%       43.750000
max       75.000000
Name: age, dtype: float64

Race: Asian-Pac-Islander, Sex: Male
count    693.000000
mean      39.073593
std       12.883944
min       18.000000
25%       29.000000
50%       37.000000
75%       46.000000
max       90.000000
Name: age, dtype: float64

Race: Black, Sex: Female
count    1555.000000
mean       37.854019
std        12.637197
min        17.000000
25%        28.000000
50%        37.000000
75%        46.000000
max        90.000000
Name: age, dtype: float64

Race: Black, Sex: Male
count    1569.000000
mean       37.682600
std        12.882612
min        17.000000
25%        27.000000
50%        36.000000
75%        46.000000
max        90.000000
Name: age, dtype: float64

Race: Other, Sex: Female
count    109.000000
mean      31.678899
std       11.631599
min       17.000000
25%       23.000000
50%       29.000000
75%       39.000000
max       74.000000
Name: age, dtype: float64

Race: Other, Sex: Male
count    162.000000
mean      34.654321
std       11.355531
min       17.000000
25%       26.000000
50%       32.000000
75%       42.000000
max       77.000000
Name: age, dtype: float64

Race: White, Sex: Female
count    8642.000000
mean       36.811618
std        14.329093
min        17.000000
25%        25.000000
50%        35.000000
75%        46.000000
max        90.000000
Name: age, dtype: float64

Race: White, Sex: Male
count    19174.000000
mean        39.652498
std         13.436029
min         17.000000
25%         29.000000
50%         38.000000
75%         49.000000
max         90.000000
Name: age, dtype: float64

**8. Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (*marital-status* feature)? Consider as married those who have a *marital-status* starting with *Married* (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.**

We'll create a new feature called `relationship-status`. This will help us classify `marital-status` to either married or single. 
In order to create this new feature, we will use the `apply()` method because the apply method can also be used to apply a function to each row.

In [89]:
def relationship_status(value):
    if value.startswith('Married'):
        return "married"
    return "single"
           
data['relationship-status'] = data['marital-status'].apply(relationship_status)
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,relationship-status
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,single
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,married
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,single
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,married
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,married

Now that our new feature is created , we can use `crosstab()` to see how the distribution between 2 variables. In this case, we want to compare the `salary` to our newly created feature `relationship-status`.

In [95]:
# getting only the men
males = data[data['sex'] == "Male"]

pd.crosstab(males['salary'], males['relationship-status'])

relationship-status  married  single
salary
<=50K                   7576    7552
>50K                    5965     697

Most of the rich people are married :)

**9. What is the maximum number of hours a person works per week (*hours-per-week* feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?**

In [119]:
max_hours = data['hours-per-week'].max()
print("The maximum number of hours a person works per week is {}hrs ".format(max_hours))

num_max_hour_workers = data[data['hours-per-week'] == max_hours]
print("{} people work {}hrs per week".format(num_max_hour_workers.shape[0],max_hours))

high_earners = num_max_hour_workers[num_max_hour_workers['salary'] == ">50K"]
num = (high_earners.shape[0] / num_max_hour_workers. shape[0]) * 100
print("{}% of people who work max hours are rich ".format( round( num, 2 )) )

The maximum number of hours a person works per week is 99hrs
85 people work 99hrs per week
29.41% of people who work max hours are rich

**10. Count the average time of work (*hours-per-week*) for those who earn a little and a lot (*salary*) for each country (*native-country*). What will these be for Japan?**

In [135]:
for (country, salary), df in data.groupby(['native-country','salary']):
    print("\n{} : {}".format(country, salary))
    print("Mean is ",df['age'].mean())

? : <=50K
Mean is  36.85354691075515

? : >50K
Mean is  44.32876712328767

Cambodia : <=50K
Mean is  35.666666666666664

Cambodia : >50K
Mean is  41.42857142857143

Canada : <=50K
Mean is  41.01219512195122

Canada : >50K
Mean is  45.76923076923077

China : <=50K
Mean is  41.8

China : >50K
Mean is  44.55

Columbia : <=50K
Mean is  39.228070175438596

Columbia : >50K
Mean is  53.5

Cuba : <=50K
Mean is  47.285714285714285

Cuba : >50K
Mean is  41.52

Dominican-Republic : <=50K
Mean is  37.94117647058823

Dominican-Republic : >50K
Mean is  30.5

Ecuador : <=50K
Mean is  34.833333333333336

Ecuador : >50K
Mean is  47.5

El-Salvador : <=50K
Mean is  32.649484536082475

El-Salvador : >50K
Mean is  50.111111111111114

England : <=50K
Mean is  38.96666666666667

England : >50K
Mean is  45.53333333333333

France : <=50K
Mean is  38.11764705882353

France : >50K
Mean is  40.166666666666664

Germany : <=50K
Mean is  36.81720430107527

Germany : >50K
Mean is  44.40909090909091

Greece : <=50K
Mean is  44.666666666666664

Greece : >50K
Mean is  50.25

Guatemala : <=50K
Mean is  32.26229508196721

Guatemala : >50K
Mean is  35.666666666666664

Haiti : <=50K
Mean is  37.3

Haiti : >50K
Mean is  48.0

Holand-Netherlands : <=50K
Mean is  32.0

Honduras : <=50K
Mean is  32.75

Honduras : >50K
Mean is  47.0

Hong : <=50K
Mean is  34.57142857142857

Hong : >50K
Mean is  31.5

Hungary : <=50K
Mean is  47.0

Hungary : >50K
Mean is  57.333333333333336

India : <=50K
Mean is  35.733333333333334

India : >50K
Mean is  41.625

Iran : <=50K
Mean is  38.12

Iran : >50K
Mean is  41.22222222222222

Ireland : <=50K
Mean is  34.578947368421055

Ireland : >50K
Mean is  43.6

Italy : <=50K
Mean is  44.375

Italy : >50K
Mean is  50.36

Jamaica : <=50K
Mean is  34.67605633802817

Jamaica : >50K
Mean is  42.1

Japan : <=50K
Mean is  35.31578947368421

Japan : >50K
Mean is  42.875

Laos : <=50K
Mean is  33.9375

Laos : >50K
Mean is  41.0

Mexico : <=50K
Mean is  32.90163934426229

Mexico : >50K
Mean is  40.484848484848484

Nicaragua : <=50K
Mean is  33.59375

Nicaragua : >50K
Mean is  34.0

Outlying-US(Guam-USVI-etc) : <=50K
Mean is  38.714285714285715

Peru : <=50K
Mean is  35.37931034482759

Peru : >50K
Mean is  33.5

Philippines : <=50K
Mean is  37.97810218978102

Philippines : >50K
Mean is  42.73770491803279

Poland : <=50K
Mean is  41.25

Poland : >50K
Mean is  50.583333333333336

Portugal : <=50K
Mean is  40.333333333333336

Portugal : >50K
Mean is  40.0

Puerto-Rico : <=50K
Mean is  39.80392156862745

Puerto-Rico : >50K
Mean is  46.5

Scotland : <=50K
Mean is  36.333333333333336

Scotland : >50K
Mean is  52.666666666666664

South : <=50K
Mean is  37.21875

South : >50K
Mean is  44.875

Taiwan : <=50K
Mean is  29.322580645161292

Taiwan : >50K
Mean is  40.8

Thailand : <=50K
Mean is  35.4

Thailand : >50K
Mean is  32.666666666666664

Trinadad&Tobago : <=50K
Mean is  41.1764705882353

Trinadad&Tobago : >50K
Mean is  42.5

United-States : <=50K
Mean is  36.816718941770084

United-States : >50K
Mean is  44.29716915353507

Vietnam : <=50K
Mean is  33.95161290322581

Vietnam : >50K
Mean is  35.4

Yugoslavia : <=50K
Mean is  38.0

Yugoslavia : >50K
Mean is  40.166666666666664

### References

1. [mlcourse.ai](https://mlcourse.ai) - Open Machine Learning Course by [Yury Kashnitsky](https://www.linkedin.com/in/festline/). Translated and edited by [Sergey Isaev](https://www.linkedin.com/in/isvforall/), [Artem Trunov](https://www.linkedin.com/in/datamove/), [Anastasia Manokhina](https://www.linkedin.com/in/anastasiamanokhina/), and [Yuanyuan Pao](https://www.linkedin.com/in/yuanyuanpao/)

2.